import pandas as pd
import pytest


@pytest.fixture
def sample_df():
    return pd.DataFrame(
        {
            "Дата операции": [
                "2024-10-01",
                "2024-10-02",
                "2024-10-03",
                "2024-11-01",
                "2024-11-02",
                "2024-11-03",
                "2024-12-01",
                "2024-12-02",
                "2024-12-03",
            ],
            "Дата платежа": [
                "01.10.2024",
                "02.10.2024",
                "03.10.2024",
                "01.11.2024",
                "02.11.2024",
                "03.11.2024",
                "01.12.2024",
                "02.12.2024",
                "03.12.2024",
            ],
            "Сумма платежа": [-100, -200, -300, -400, -500, -600, -700, -800, -900],
            "Категория": [
                "Супермаркеты",
                "Супермаркеты",
                "Кафе",
                "Супермаркеты",
                "Кафе",
                "Супермаркеты",
                "Кафе",
                "Супермаркеты",
                "Супермаркеты",
            ],
            "Описание": [
                "Магнит",
                "Пятерочка",
                "Кофейня",
                "Перекресток",
                "Шоколадница",
                "Ашан",
                "Кофейня",
                "Metro",
                "FixPrice",
            ],
            "Номер карты": ["*5091", "*1111", "*2222", "*3333", "*4444", "*5555", "*6666", "*7777", "*8888"],
        }
    )


@pytest.fixture
def sample_user_settings():
    return {"user_currencies": ["USD", "EUR"], "user_stocks": ["AAPL", "AMZN", "GOOGL", "MSFT", "TSLA"]}
